<?php
return array(
	'INSERT_DATA_FAILED' => '插入数据失败',
    
    
    
    
	'1' => '成功',
    '2' => '该号码已注册',
    '3' => '该号码不存,在请注册',
    '4' => '密码错误',
    '5' => '缺少参数',
    '6' => '您还未登陆，请登陆',
	'7' => '余额不足',
	'8' => '该沙发已被其他用户更高价格购买',
	'9' => '守护已被抢完',
	'10' => '次数已用完',
	'11' => '旧密码输入错误',
	'12' => '两次密码不一致',
	'13' => '不符合密码规则',
	'14' => '操作数据库失败',
	'15' => '该靓号已被购买',
	'16' => '头像上传失败',
    
    
    'SPEND' => '花费',
    'MONEY_UNIT' => '秀币',
    'BECOMETOBE' => '成为',
    'GUARD' => '守护',
    'GRAB' => '抢了',
    'POSITION' => '位置',
    'PRESENT' => '赠送',
    
    
    
    
    '1000' => '座驾',
    '1001' => '会员',
    '1002' => '靓号',
    '1003' => '充值',
    '1004' => '守护',
    
    '405' => 'AppKey为空',
    '406' => 'AppKey无效',
    '456' => '国家代码或手机号码为空',
    '457' => '手机号码格式错误',
    '466' => '请求校验的验证码为空',
    '467' => '请求校验验证码频繁（5分钟内同一个appkey的同一个号码最多只能校验三次）',
    '468' => '验证码错误',
    '474' => '没有打开服务端验证开关',
	'DEFAULT_WAASHOW_NICKNAME' => 'waashow',
    'DAY' => 'd',    
    'HOUR' => 'h',    
    'MINUTE' => 'm', 
    'SYSTEM_MESSAGE' => '系统消息',
    'YOU_ILLEGAL_LIVE' => '您涉嫌违规直播,',
    'ALREADY_BAN' => '已被禁播',  
    'CONTACT_HOTLINE' => '有疑问请联系客服08.38.635287.',
    'ILLEGAL_LIVE' => '涉嫌违规直播', 
    'THANK_REPORT' => '感谢您的举报！',   
);